In [181]:
import pandas as pd
import numpy as np

## Present Working Directory

In [182]:
%pwd

'/Users/nishanthegde/Desktop/Data Science projects/titanic'

In [183]:
path = '/Users/nishanthegde/Desktop/Data Science projects/titanic/'

## Listing all the files in pwd

In [184]:
%ls

Titanic_code.py.ipynb   gender_submission.csv   train.csv
Titanic_practice.ipynb  test.csv

In [185]:
train_file = "train.csv"
test_file = "test.csv"

## Reading the train file and test file

In [186]:
xdf = pd.read_csv(path + train_file)
tdf = pd.read_csv(path + test_file)

In [187]:
xdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [188]:
tdf.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Dropping duplicates and Nan values

In [189]:
xdf.drop_duplicates(inplace = True)
tdf.drop_duplicates(inplace = True)

xdf.dropna(axis = 0, inplace = True)
tdf.dropna(axis = 0, inplace = True)

In [190]:
xdf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [191]:
tdf.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
24,916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
26,918,1,"Ostby, Miss. Helene Ragnhild",female,22.0,0,1,113509,61.9792,B36,C
28,920,1,"Brady, Mr. John Bertram",male,41.0,0,0,113054,30.5000,A21,S

## Statistical Description of the dataset

In [192]:
xdf.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000,183.000000
mean,455.366120,0.672131,1.191257,35.674426,0.464481,0.475410,78.682469
std,247.052476,0.470725,0.515187,15.643866,0.644159,0.754617,76.347843
min,2.000000,0.000000,1.000000,0.920000,0.000000,0.000000,0.000000
25%,263.500000,0.000000,1.000000,24.000000,0.000000,0.000000,29.700000
50%,457.000000,1.000000,1.000000,36.000000,0.000000,0.000000,57.000000
75%,676.000000,1.000000,1.000000,47.500000,1.000000,1.000000,90.000000
max,890.000000,1.000000,3.000000,80.000000,3.000000,4.000000,512.329200

In [193]:
tdf.describe()

       PassengerId     Pclass        Age      SibSp      Parch        Fare
count    87.000000  87.000000  87.000000  87.000000  87.000000   87.000000
mean   1102.712644   1.137931  39.247126   0.597701   0.482759   98.109198
std     126.751901   0.435954  15.218730   0.637214   0.860801   88.177319
min     904.000000   1.000000   1.000000   0.000000   0.000000    0.000000
25%     986.000000   1.000000  27.000000   0.000000   0.000000   35.339600
50%    1094.000000   1.000000  39.000000   1.000000   0.000000   71.283300
75%    1216.000000   1.000000  50.000000   1.000000   1.000000  135.066650
max    1306.000000   3.000000  76.000000   3.000000   4.000000  512.329200

## Dropping unimportant features

In [194]:
xdf.drop(["PassengerId", "Name", "Ticket", "Cabin"], axis = 1, inplace = True)
tdf.drop(["PassengerId", "Name", "Ticket", "Cabin"], axis = 1, inplace = True)

In [195]:
xdf.head()

    Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
1          1       1  female  38.0      1      0  71.2833        C
3          1       1  female  35.0      1      0  53.1000        S
6          0       1    male  54.0      0      0  51.8625        S
10         1       3  female   4.0      1      1  16.7000        S
11         1       1  female  58.0      0      0  26.5500        S

In [196]:
tdf.head()

    Pclass     Sex   Age  SibSp  Parch      Fare Embarked
12       1  female  23.0      1      0   82.2667        S
14       1  female  47.0      1      0   61.1750        S
24       1  female  48.0      1      3  262.3750        C
26       1  female  22.0      0      1   61.9792        C
28       1    male  41.0      0      0   30.5000        S

In [197]:
xdf.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked'],
      dtype='object')

In [198]:
labels = xdf["Survived"]

In [199]:
xdf.drop(["Survived"], axis = 1, inplace = True)

## Encoding

In [200]:
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()

In [201]:
s = (tdf.dtypes == 'object')
object_cols = list(s[s].index)

print("Categorical variables:")
print(object_cols)

Categorical variables:
['Sex', 'Embarked']

In [202]:
for columns in object_cols[:1]:
    xdf[columns] = enc.fit_transform(xdf[columns])
    
for columns in object_cols[1:2]:
    xdf[columns] = enc.fit_transform(xdf[columns])



for columns in object_cols[:1]:
    tdf[columns] = enc.fit_transform(tdf[columns])
    
for columns in object_cols[1:2]:
    tdf[columns] = enc.fit_transform(tdf[columns])

In [203]:
xdf.head()

    Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
1        1    0  38.0      1      0  71.2833         0
3        1    0  35.0      1      0  53.1000         2
6        1    1  54.0      0      0  51.8625         2
10       3    0   4.0      1      1  16.7000         2
11       1    0  58.0      0      0  26.5500         2

In [204]:
tdf.head()

    Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
12       1    0  23.0      1      0   82.2667         2
14       1    0  47.0      1      0   61.1750         2
24       1    0  48.0      1      3  262.3750         0
26       1    0  22.0      0      1   61.9792         0
28       1    1  41.0      0      0   30.5000         2

In [205]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, precision_score, f1_score
train_x, test_x, train_y, test_y = train_test_split(xdf, labels, test_size = 0.1, random_state = 10)

## Logistic Regression

In [206]:
from sklearn.linear_model import LogisticRegression

In [207]:
log_reg = LogisticRegression(random_state=0)

In [208]:
log_reg.fit(train_x, train_y)

preds = log_reg.predict(test_x)

/opt/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [209]:
print(preds)

[1 1 0 1 1 1 1 0 0 1 0 1 0 1 1 1 1 1 1]

In [210]:
print("Scores for Logistic Regression Classifier")
print("Accuracy : ", accuracy_score(test_y, preds))
print("Precision : ", precision_score(test_y, preds))
print("F1 score : ", f1_score(test_y, preds))

Scores for Logistic Regression Classifier
Accuracy :  0.8947368421052632
Precision :  0.8571428571428571
F1 score :  0.923076923076923

## Decision Tree Classifier

In [211]:
from sklearn.tree import DecisionTreeClassifier

In [212]:
tree_clf = DecisionTreeClassifier(criterion = "entropy", random_state = 3)

In [213]:
tree_clf.fit(train_x, train_y)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=3, splitter='best')

In [214]:
preds = tree_clf.predict(test_x)

In [215]:
print("Scores for Decision Tree Classifier")
print("Accuracy : ", accuracy_score(test_y, preds))
print("Precision : ", precision_score(test_y, preds))
print("F1 score : ", f1_score(test_y, preds))

Scores for Decision Tree Classifier
Accuracy :  0.8947368421052632
Precision :  1.0
F1 score :  0.9090909090909091

## Random Forest Classifier

In [216]:
from sklearn.ensemble import RandomForestClassifier

In [217]:
forest_clf = RandomForestClassifier(n_estimators=100, criterion='gini', max_depth = 15, bootstrap = True)

In [218]:
forest_clf.fit(train_x, train_y)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=15, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=100,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [219]:
preds = forest_clf.predict(test_x)

In [220]:
print("Scores for Random Forest Classifier")

print("Accuracy : ", accuracy_score(test_y, preds))
print("Precision : ", precision_score(test_y, preds))
print("F1 score : ", f1_score(test_y, preds))

Scores for Random Forest Classifier
Accuracy :  0.9473684210526315
Precision :  0.9230769230769231
F1 score :  0.9600000000000001

## Making final predictions

In [222]:
final_preds = forest_clf.predict(tdf)

In [223]:
print(final_preds)

[1 1 1 1 0 1 1 0 1 1 1 0 1 1 0 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 0 0 1 1 1 1 1
 1 1 1 1 1 1 0 1 0 1 1 1 1 1 0 1 1 0 1 0 0 1 1 0 1 0 0 1 1 0 1 1 1 1 1 1 1
 0 1 0 1 1 1 1 1 1 1 0 1 1]

In [225]:
tdf = pd.read_csv(path + test_file)

In [226]:
preds = pd.DataFrame(preds, columns = ['Survived'])     #Creating a dataframe of the predictions for submission
preds['PassengerId'] = tdf['PassengerId']
preds = preds[['PassengerId', 'Survived']]
preds.head()

   PassengerId  Survived
0          892         1
1          893         1
2          894         0
3          895         1
4          896         1

In [227]:
preds.to_csv(path + "submit.csv", index = False)